{
  "backend/main.mo": "Implements user profiles and privacy settings with access control, including auto-stop tracking and blocklist management.",
  "feature_evidence.json": "Contains feature-to-file mapping evidence for the privacy dashboard, including tracker scanning, blocklist, logging, and backend integration.",
  "frontend-file-summaries.txt": "Provides short descriptions of all frontend files and their roles in the privacy dashboard.",
  "frontend/index.css": "Defines global Tailwind-based OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring together header, protection status, scanner, blocklist, log, and profile setup UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading states and error recovery.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to save their profile name with validation and mutation handling.",
  "frontend/src/components/privacy/BlocklistManager.tsx": "UI for viewing and editing a user’s custom blocklist, handling add/remove operations and displaying built‑in tracker counts.",
  "frontend/src/components/privacy/Header.tsx": "Renders the privacy dashboard header with branding, login state, and a disclaimer about non‑VPN functionality.",
  "frontend/src/components/privacy/ProtectionLogView.tsx": "Displays recent tracker scan logs with timestamps and provides a dialog to clear all entries.",
  "frontend/src/components/privacy/ProtectionStatusCard.tsx": "Shows current protection state and allows toggling auto‑stop tracking, with authentication‑gated settings.",
  "frontend/src/components/privacy/ScanResultsList.tsx": "Presents scan results broken into trackers and clean domains with status badges and scrollable lists.",
  "frontend/src/components/privacy/TrackerScanner.tsx": "Allows single or multi‑domain scanning, classifies domains as trackers or clean, logs results, and shows scan output.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, reinitializing when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity auth, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useProtectionLog.ts": "Manages a list of protection log entries with localStorage persistence, supporting adding and clearing entries.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, privacy settings, and blocklist data via an actor.",
  "frontend/src/index.css": "Configures Tailwind and defines light/dark theme color variables and utility classes for themed UI states.",
  "frontend/src/lib/domainParsing.ts": "Parses and validates domain input lines, normalizing them and returning structured results with error info.",
  "frontend/src/lib/trackerBlocklist.ts": "Contains built‑in tracker domains and utilities for normalizing domains, checking tracker matches, and combining blocklists.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a VPN-like privacy dashboard, its features, image requirements, and known architectural notes."
}