{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Incognibro public accessibility: branding, SEO static files, and custom-domain readiness (frontend-only)",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Rename all user-visible branding and document metadata to “Incognibro” so no old name appears in the UI.",
      "acceptanceCriteria": [
        "In frontend/src/components/privacy/Header.tsx, the header brand text shows \"Incognibro\" (not \"Privacy Shield\").",
        "In frontend/index.html, the <title> is updated to \"Incognibro\".",
        "All other visible occurrences of the old app name are updated to \"Incognibro\" (e.g., any headings/labels that previously referenced the old name).",
        "All user-facing text updated/added by this change is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/privacy/Header.tsx",
          "operation": "modify",
          "description": "Update the displayed brand name to “Incognibro” and replace any remaining old-name strings in user-visible header content (including image alt text) while keeping the existing non‑VPN disclaimer behavior intact."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the document <title> to “Incognibro” and ensure any other old-name metadata text is replaced with English Incognibro branding."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit and update any remaining user-visible occurrences of the old app name (if present) so the UI is consistently branded as “Incognibro” in English."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add SPA-friendly SEO and indexing readiness via standard static files and basic HTML metadata.",
      "acceptanceCriteria": [
        "The app serves a robots.txt that allows crawling (no blanket disallow rules).",
        "The app serves a sitemap.xml suitable for a single-page app (at minimum, includes the root URL entry).",
        "frontend/index.html includes standard SEO metadata for the Incognibro app (at minimum: updated title alignment with Incognibro and a meta description).",
        "All added metadata text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/public/robots.txt",
          "operation": "create",
          "description": "Add robots.txt that allows crawling (no blanket disallow) and references the sitemap location for Incognibro."
        },
        {
          "path": "frontend/public/sitemap.xml",
          "operation": "create",
          "description": "Add a minimal sitemap.xml for a single-page app that includes at least the root URL entry; align the URL(s) with the project’s configurable canonical/public base URL strategy (see REQ-10)."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add standard SEO metadata in English suitable for a SPA (at minimum: meta description) and ensure the title aligns with “Incognibro”; include a canonical link strategy compatible with REQ-10’s configurable public base URL."
        },
        {
          "path": "frontend/src/seo/useSeoMetadata.ts",
          "operation": "create",
          "description": "Create a small SEO helper hook to set/update document title and canonical/meta description at runtime for SPA navigation, using the configured public base URL (see REQ-10)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the SEO metadata helper so it runs for the SPA (at least on initial load) and keeps Incognibro’s title/description/canonical consistent."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add custom-domain readiness documentation and frontend configuration for canonical/public base URL used by SEO artifacts.",
      "acceptanceCriteria": [
        "Repository includes a human-readable setup guide describing how to point a custom domain to the app (DNS records and any IC-specific steps), written in English.",
        "Frontend supports configuring the canonical/public base URL (so sitemap/canonical references can be correct when a custom domain is used).",
        "Documentation explicitly notes that Google indexing is not immediate and depends on Google crawling after the site is publicly reachable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/site.ts",
          "operation": "create",
          "description": "Add a central site configuration module that resolves the canonical/public base URL from a build-time environment variable (with a safe runtime fallback), to be used by SEO metadata and sitemap guidance."
        },
        {
          "path": "frontend/.env.example",
          "operation": "create",
          "description": "Document the environment variable(s) needed to configure the canonical/public base URL for Incognibro (example values in English)."
        },
        {
          "path": "frontend/CUSTOM_DOMAIN_SETUP.md",
          "operation": "create",
          "description": "Create an English setup guide for mapping a custom domain to the deployed Internet Computer frontend assets, including required DNS records, any IC-specific steps, the canonical site URL to use for SEO, and an explicit note that Google indexing is not immediate and depends on crawling once the site is publicly reachable."
        },
        {
          "path": "frontend/public/sitemap.xml",
          "operation": "modify",
          "description": "Align sitemap.xml guidance/content with the canonical/public base URL configuration approach described in frontend/src/config/site.ts and the custom-domain setup guide (ensure at least the root URL entry is present)."
        }
      ]
    }
  ]
}